Catalogs/Покраски_SCT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Покраски_SCT</Name>
			<Comment>Довідник варіантів фарбування профілів Schueco</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрендыПокраски_SCT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЗаказчика_SCT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаПокраски_SCT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Покраски_SCT/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ФормироватьНаименование =
		Не ДополнительныеСвойства.Свойство("РабочееНаименованиеСформировано")
		И НЕ ЗначениеЗаполнено(Наименование);

	Если ФормироватьНаименование Тогда
		СформированноеНаименование = СформироватьНаименованиеПоРеквизитам();
		Если ЗначениеЗаполнено(СформированноеНаименование) Тогда
			Наименование = Лев(СформированноеНаименование, 100);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ТекстИсключения = НСтр("ru='Для покраски необходимо указать хотя бы Цвет, Бренд или Объект заказчика — Наименование формируется автоматически из этих реквизитов';uk='Для фарбування потрібно вказати хоча б Колір, Бренд або Об''єкт замовника — Найменування формується автоматично з цих реквізитів'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Собирает Наименование из заполненных реквизитов по шаблону "Цвет — Бренд — ОбъектЗаказчика".
// Пустые реквизиты пропускаются; разделитель " — " применяется только между фактически заполненными частями.
Функция СформироватьНаименованиеПоРеквизитам() Экспорт
	
	Части = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектЗаказчика) Тогда
		Части.Добавить(СокрЛП(Строка(ОбъектЗаказчика)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Бренд) Тогда
		Части.Добавить(СокрЛП(Строка(Бренд)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Цвет) Тогда
		Части.Добавить(СокрЛП(Строка(Цвет)));
	КонецЕсли;

	Возврат СтрСоединить(Части, " ");
	
КонецФункции

#КонецОбласти

#КонецЕсли
